app/views/articles/show.html.erb

SELECT COUNT(*) FROM `comments` WHERE `comments`.`article_id` = 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 1
---
    <div class="container">
        <h2 class="subtitle is-5"><strong><%= @article.comments.count %></strong> Comments</h2>