app/controllers/articles_controller.rb

SELECT COUNT(*) FROM `articles`
---
  def index
    #@articles = Article.all
    @articles = Article.order(:created_at).page(params[:page]).per_page(50)

INSERT INTO `articles` (`title`, `content`, `created_at`, `updated_at`, `avatars`) VALUES ('Articles51', 'Articles51', '2018-05-20 03:26:45', '2018-05-20 03:26:45', '[\"something.jpg\",\"something.jpg\",\"something.jpg\"]')
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save