app/controllers/comments_controller.rb

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`name`, `content`, `article_id`, `created_at`, `updated_at`, `user_id`) VALUES ('Test', 'Comment1', 1, '2018-05-20 12:47:19', '2018-05-20 12:47:19', 3)
---
  def create
    @article = Article.find params[:article_id]
    @comment = @article.comments.new(comment_params)
    @comment.user_id = current_user.id

    respond_to do |format|
      if @comment.save

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1
---
  def destroy
     @article = Article.find params[:article_id]
    @comment.destroy