app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `password_digest` = '$2a$10$5B5EItDH0bcSv5w2BTY9NO7XywY3EQBQ9otk1rzsmp/nZwsGyLyBa', `avatars` = '[\"gru2.jpeg\"]', `updated_at` = '2018-05-20 08:38:43' WHERE `users`.`id` = 2

def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`first_name`, `last_name`, `email`, `created_at`, `updated_at`, `password_digest`, `avatars`) VALUES ('shiva', 'kumar', 'shiva@gmail.com', '2018-05-20 08:58:07', '2018-05-20 08:58:07', '$2a$10$ZMlWo/yNk8xu9w7waeYH.eBQ7Al1VfPqdGOnzHoThBgOz06MP.fWy', '[\"gru2.jpeg\"]')

    def set_user
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1